Gets the number of routing criteria.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public int NumberOfCriteria { get; }
  Visual Basic
Public ReadOnly Property NumberOfCriteria As Integer
	Get
  Visual C++
public:
property int NumberOfCriteria {
	int get ();
}
 See Also
  RoutingPreferenceRule Class
  Autodesk.Revit.DB Namespace